src/cfe/InformationRegisters/ДБГруппыКонтрагентовДляОплатЖКХАВА.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ДБГруппыКонтрагентовДляОплатЖКХАВА</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагенты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппыОтчетности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДБГруппыОтчетности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/Enums/ДБГруппыОтчетности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ДБГруппыОтчетности</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Бюджет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Население</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеПотребители</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cfe/InformationRegisters/ДБГруппыКонтрагентовДляОплатЖКХАВА/Ext/ManagerModule.bsl
////////////////////////////////////////////////////////////////////////////////
// <Заголовок модуля: краткое описание и условия применения модуля.>
//  
////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ПрограммныйИнтерфейс
	
	Процедура ЗаписьДвиженийДокумента(Отказ, РежимПроведения, Ссылка, ПараметрыПроведения)Экспорт 
		
		НаборЗаписей = РегистрыСведений.ДБГруппыКонтрагентовДляОплатЖКХАВА.СоздатьНаборЗаписей();	
			
		Организация = ПараметрыПроведения.Организация;
		НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
		
		Секунда  = 0;
		Для каждого СтрокаБюджет Из ПараметрыПроведения.Бюджет Цикл
			Движение = НаборЗаписей.Добавить();
			Движение.Период = ТекущаяДатаСеанса()+Секунда;
			Движение.Организация = Организация;
			Движение.ГруппыОтчетности = Перечисления.ДБГруппыОтчетности.Бюджет;
			Движение.Контрагенты = СтрокаБюджет.Контрагент;
			Секунда = Секунда + 1;
		КонецЦикла;
		
		Для каждого СтрокаНаселение Из ПараметрыПроведения.Население Цикл
			Движение = НаборЗаписей.Добавить();
			Движение.Период = ТекущаяДатаСеанса()+Секунда;
			Движение.Организация = Организация;
			Движение.ГруппыОтчетности = Перечисления.ДБГруппыОтчетности.Население;
			Движение.Контрагенты = СтрокаНаселение.Контрагент;
			Секунда = Секунда + 1;
		КонецЦикла;
		
		Для каждого СтрокаПрочиеПотребители Из ПараметрыПроведения.ПрочиеПотребители Цикл
			Движение = НаборЗаписей.Добавить();
			Движение.Период = ТекущаяДатаСеанса()+Секунда;
			Движение.Организация = Организация;
			Движение.ГруппыОтчетности = Перечисления.ДБГруппыОтчетности.ПрочиеПотребители;
			Движение.Контрагенты = СтрокаПрочиеПотребители.Контрагент;
			Секунда = Секунда + 1;
		КонецЦикла;
		
		НаборЗаписей.Записать();
		
	КонецПроцедуры
	
	#КонецОбласти
	
	#Область СлужебныеПроцедурыИФункции
	
	#КонецОбласти
	
#КонецЕсли
